Cases/preCICE_Case/Fluid-buoyantPimpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
    (0 0.025 0)
    (1 0.025 0)
    (1 0.1 0)
    (0 0.1 0)
    (0 0.025 1e-2)
    (1 0.025 1e-2)
    (1 0.1 1e-2)
    (0 0.1 1e-2)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (150 25 1) simpleGrading (6 15 1)
);

edges           
(
);

boundary
(
    top
    {
	type	wall;
	faces
	(
        	(3 7 6 2)
	);
    }

    interface
    {
	type 	wall;
        faces
	(
		(1 5 4 0)
	);
    }


    inlet
    {
	type	inletOutlet;
	faces
	(
        	(0 4 7 3)
	);
    }

    outlet
    {
        type	inletOutlet;
	faces
	(
		(2 6 5 1)
	);
    }

    frontAndBack
    {
        type	empty;
	faces
	(
		(0 3 2 1)
        	(4 5 6 7)
	);
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
